["Rock, Paper, Scissors, Chuck Norris wins.","Chuck Norris was orginally casted as the main character for salt but then they changed it to Angelia Jolie, look at her face now.","Satan himself is a massive Chuck Norris fan, but Chuck made him member #777 just to piss him off.","Chuck Norris once tried to wear glasses, the result was him seing his back.","Chuck Norris doesn't read books. He stares them down until he gets the information he wants.","Chuck Norris shaves his scrotum with a potato peeler.","The idea of Pepsi came to fruition when Chuck Norris micturated in a can. The idea of Crystal Pepsi came to fruition when Chuck Norris drank lots of water one day and pissed in a bottle.","The only time Chuck Norris ever displays any sort of mercy is when his hemorrhoids are bleeding.","Any conservitive estimate of the amount of presents Chuck Norris has received each year for Christmas is still in the billions.","Chuck Norris came in your girlfriends butt","In honor of Earth Day, Chuck Norris threw a massive BBQ and kegger in the middle of the Amazon rain forest.","Chuck Norris can win at the game Battleship by simply banging Rihanna.","Chuck Norris doesn't get flu shots because he nevers gets sick.","Chuck Norris once played a game of basketball with Walt Disney's head.","Chuck Norris won the world jump roping championships, and as a literal handicap, he did it in a wheelchair. Next year he plans to try it on crutches!","Chuck Norris thinks ping-pong is a sissy game. That's why he invented Oklahoma-pong which is alot like ping-pong except it's played with a cannonball & a manhole cover.","Super Villans would terrorize the world but Chuck Norris kills them all. Consequentially Super Heroes are unemployed.","Usain Bolt once ran against Chuck Norris in a 40 yard dash. Bolt had a 20 yard head start. Chuck Norris won by 5 yards.","The California Redwood forest is Chuck Norris toothpick factory","Chuck Norris kills the elephant in the room.","Chuck Norris went back in time and punched Moses in the face, just to prove that he could do it.","Even at 70, Chuck Norris still ain't too old for this shit.","Did you know that Mother Nature had a one-night-stand with Father Time? The result was Chuck Norris.","Much like a top fuel dragracer, Chuck Norris' penis is equipped with a parachute.","Who watches the Watchmen? Chuck Norris.","Once Chuck Norris actually tried on one of his roundhouse kicks. This was also the start of World war 1 and the aftershock of the beginning of World war 2","Chuck Norris knows how to shut down Skynet. Warner Bros beged him not to so they can make some money out of it.","Chuck Norris is the best American Sniper by far. He once made an 1,800 yard kill shot in the mountains of Afghanistan using only his trusty Donald Duck PEZ dispenser.","Chuck Norris' first car was Optimus Prime.","Why is Chuck Norris awesome? because hes Chuck Norris.","Chuck Norris is friends with Sonic The Hedgehog. They race often, too. Unsurprisingly, Sonic loses every time he doesn't cheat.","Chuck Norris turned lead into gold.","Chuck Norris likes to force-feed Navy SEALs fish.","King Solomon suggested cutting the baby in half. Chuck Norris ACTUALLY cut the baby in half, ate it, and proceeded to impregnate both women while bellowing \" The essence of this baby will live on through the gift of my mighty seed!\"","The closest Chuck Norris has come to getting his ass kicked was when he gave himself a dirty look in the mirror.","Ok im back. Chuck Norris was secretly included for Mortal Kombat X. The developers then changed their minds and removed him because 1 hit from Chuck Norris= a fatality.","If a mosquito sucks Chuck Norris' blood, Chuck Norris eats the mosquito...so he can take back whats his.","Nothing can escape the gravity of a black hole, except for Chuck Norris. Chuck Norris eats black holes. They taste like chicken.","Chuck Norris gets ever so slightly more healthy and strong with each cigar.","As a child, Chuck Norris asked for and received a car full of clowns for his birthday parties every year. Without fail, he would beat the shit out of each and every one.","Chuck Norris is the undisputed lord and master of trampoline sex.","God is still slightly pissed off at Chuck Norris for using his halo to kill so many people... but he won't say anything about it.","Ice doesn't melt in the Sun,Chuck Norris melts it with his.....MIND!","If Chuck Norris gets pulled over, HE lets the policeman off with a warning.","When bored, Chuck Norris will play Hopscotch on your face.","The original title for Big Hero 6 was Big Chuck Norris 6. The movie was cancelled after going into production becuase nobody would pay 13 dollars to see a 28 second-long movie.","Fanboys such as Genwunners are made when Chuck Norris is hungry for the exact part of the brain that accepts opinions.","Chuck Norris can bitch slap a Lowland Gorilla and get away with it.","barry chuck once said: paul chuckle is a dick but barry chuckle didnt realise that paul was Chuck Norris in desguise then, a week later paul killed techno viking by mistake and Chuck Norris destroyed royal mail, then killed the mexicans who \"wanted a fight\". the moral of the story is joe morris likes Chuck Norris and barry chuckle, because sometimes pauls just not enough!","Chuck Norris injects hot coffee directly into his eyeballs.","The Death Star's original name was Space Station Chuck Norris.","Chuck Norris can give a Ninntendo Gameboy a sex-change and create a Gamegirl.","There is no such thing as a Chuck Norris joke, only facts.","Rick James died of a heart attack when he heard the words 'I'm Chuck Norris, bitch'.","If you find Chuck Norris while playing hide and seek, you lose.","Chuck Norris uses a cement mixer filled with silk pillows as a fleshlight.","Chuck Norris can stack cups without moving his hands or eyes.","Charlie Sheen is Chuck Norris' lovechild.","Chuck Norris catches the early bird.","Chuck Norris plays racquetball with a waffle iron and a bowling ball.","Chuck Norris CAN turn lead into gold.","Chuck Norris is the man who shot Liberty Valance.","Chuck Norris' cowboy boots are made form real cowboys","CHuck norris can pole vault with a garden hose.","Chuck Norris can parallel park a freight train","Chuck Norris doesn't celebrate christmas christmas celebrates Chuck Norris","Chuck Norris' grandfather presented him with an alarm clock on his 7th birthday. Chuck Norris roundhouse kicked and broke the clock into a million pieces. Nothing alarms Chuck Norris. Btw Chuck Norris' grandfather is also Chuck Norris.","If you're ever stupid enough to ask for Chuck Norris' credentials, expect to witness something completely mind-blowing and impossibly awesome just before your brutal death.","Chuck Norris can smell what you had for dinner... three weeks ago","Chuck Norris can win a gun fight by saying BANG!","Chuck Norris never pays the ferryman.","Chuck Norris balls is where u get the term, you dont have the stones.","Chuck Norris was the only senior in his high school.","Chuck Norris doesn't snowboard the mountain just moves beneath Chuck Norris","Chuck Norris is so much if a man that he sees everybody as a woman","When Chuck Norris prepares a smoked salmon, he wraps it in Zig-Zag.","Chuck Norris uses a Glock as a PEZ dispenser.","Chuck Norris that invented Cunnilingus.","Chuck Norris declared checkmate against the 2012 chess champion Viswanathan Anand in under 4 moves. Using only the boot from monopoly.","It took Harry Potter 7 books to defeat Voldemort. It only took Chuck Norris 7 words.","Chuck Norris doesn't pay attention, attention pays Chuck Norris.","Chuck Norris often bathes in municipal cesspools. Afterwards, Aquafina, Dasani & Evian are quick to capitalize on this opportunity to purchase low cost purified water.","Chuck Norris can watch t.v... on a chalk board.","Bad news - Chuck Norris got sick last week and died. Good news - He's feeling much better now and went back to work yesterday.","Chuck Norris won't let a female doctor tell him the results of a blood test unless she's at least an 8 and it's in Morse code with Kegel exercises.","Chuck Norris once saved Superman's life. Just to kill him again.","If you want to keep people out of your property, the most effective sign you can use is a picture of an angry Chuck Norris.","Chuck Norris cleans his toilet with a backhoe and a WeedEater.","Chuck Norris can tell a 'yo mama' joke that is so perfect, your head will explode.","Chuck Norris can punch you so hard that your blood will bleed.","Chuck Norris can make a movie with 75 cents and a dirty look.","Chuck Norris doesn't get drunk. He simply lowers his IQ to yours.","Chuck Norris was born while his mother was lion hunting on the African Savanna. Just seconds later he strangled a hyena with his own umbilical cord.","One time, Chuck Norris was crossing the street without looking both ways. He ran over a car.","Chuck Norris is the reason why Drake says YOLO.","Chuck Norris can hermetically seal a can of whoop ass and disguise it as a trick or treat gift for his annoying neighborhood kids.","Chuck Norris built the hospital where he was born.","Chuck Norris can kill godzilla by saying roar","Chuck Norris won super bowls VII and VIII singlehandedly before unexpectedly retiring to pursue a career in ass-kicking.","Some people swallow live goldfish on a dare. Chuck Norris prefers live piranha.","Industrial logging isn't the cause of deforestation. Chuck Norris needs toothpicks.","Chuck Norris built a better mousetrap, but the world was too frightened to beat a path to his door.","Chuck Norris doesn't play God of War. He is the God of War.","Chuck Norris once trew his used condom in the toilet 9months later the ninja turtles was born","Chuck Norris killed a fat guy with a poisened candy bar. and yes u r stupid for not thinking of that.","After the start of the race, Chuck Norris took a two day vacation in Italy, eviscerated a Yeti in Switzerland, then won the Tour de France by riding backwards on a tricycle while potty training a wolverine.","When Chuck Norris plays IWBTG he never died","Chuck Norris can fix stupid with duct tape but he prefers to fix it with a roundhouse kick to stupid's face.","Chuck Norris finished in first and second place in the New York Marathon. He lapped the field once.","Chuck Norris always hits the G-spot with mathematical precision.","Chuck Norris never \"attempts\" to kill. He succeeds.","Chuck Norris could land a whale with his wedding tackle.","Chuck Norris can bang your sister while your mother watches and you clap.","The square root of Chuck Norris is pain. Do not try to square Chuck Norris, the result is death.","When Chuck Norris runs out of toilet paper he makes do with a handful of sandpaper.","The reason the slinky was invented is because there is no condom long enough for Chuck norris's dick. It failed miserablly now he has to were a live ratlle snake as one.","If suddenly the world was taken over by aliens and everyone was made their slaves, Chuck Norris would be made their king, no questions asked.","Chuck Norris knows the identity of the Navy Seal's that killed Osama bin Laden it is something that even President Obama does not know or will ever know.","Chuck Norris committed the act hara-kiri last night. Later, he cleaned up the mess, cooked up some breakfast and went bass fishing.","Chuck Norris doesnt need a guard dog a guard dog needs him","Contrary To Popular Belief, Chuck Norris Won Super Bowl 46. By Phone","One time Chuck Norris rode a shark... on land while on fire while making love to three swimsuit models","In high school, Chuck Norris struck out 27 batters using only 15 pitches.","Chuck Norris can make you hang onto his every word, even the prepositions.","Most kids where superman pajamas. Superman, however, wears Chuck Norris pajamas","Willy Wonka ran sewage treatment plant until Chuck Norris pissed in it.","In museums, Chuck Norris is allowed to touch the artifacts.","Before Chuck Norris was born, the martial arts weapons with two wooden rods attached to a chain were originally called Nunwaldos. Nobody knows what happened to Waldo but they are still looking for him.","the reason why babies cry when they are born is because they know they've been brought into the same world as Chuck Norris","At school, Chuck Norris' nickname was 'Chuck Norris'.","When Chuck Norris strikes, it is literally like lightning. Count in seconds after a flash before you hear the thunder. that's how far away he is.","Chuck Norris solved the Travelling Salesman problem in O(1) time. Here's the pseudo-code: Break salesman into N pieces. Kick each piece to a different city.","dont sneak up on Chuck Norris while takin a piss","Chuck Norris's car drives over 9000 miles and never crashes.","Chuck Norris dosn't use stuntmen, stuntmen use Chuck Norris","Did you know? The name Chuck Norris means Chuck Norris in every other language.","Chuck Norris had to stop setting his phone to vibrate, the earthqaukes where killing people.","Which came first the chicken or the egg? Doesn't matter Chuck Norris is here.","when Chuck Norris bowls he does it over hand.","Fear itself fears Chuck Norris.","Chuck Norris was born in a log cabin that he built with his own two hands","God helps those who help themselves. Chuck Norris slaughters lazy assholes by the thousand.","Chuck Norris can brew coffee out of tea leaves","If you play Pink Floyd's 'Dark Side Of The Moon' while watching Delta Force 2, Chuck Norris' boot heel will sync up with your face.","Chuck Norris' Father is also Chuck Norris' son, when you sire Chuck Norris he always returns the favour.","Chuck Norris found the end of a rainbow.","anyone can pee on the floor ,but only Chuck Norris can shit on the ceiling","Some people can slide down stair banisters. Chuck Norris can slide UP down escalators.","Chuck Norris doesn't get ready for work in the morning. Work gets ready for Chuck Norris.","Chuck Norris raised the Maine with his penis. Now you don't have to remember it anymore.","Chuck Norris can hypnitize you by simply unzipping.","when Chuck Norris doesnt pay the rent, he evicts his owner.","Chuck Norris' denim shirt contains three Robin Williams's worth of chest hair.","In the time it takes you to read this sentence, Chuck Norris could have killed 25 people. Or completely satisfied 5 women...twice.","Chuck Norris was able to defeat Superman because his beard is made of pure kryptonite.","Chuck Norris does not dodge bullets, bullets dodge him out of fear.","\"Doom\" -- 1) a popular video game. 2) Your inevitable fate if you fight Chuck Norris.","The only thing Chuck Norris never had was his virginity.","March 10, 2010. Somebody attempted to give Chuck Norris his bithday spankings today. Upon impact of the first spank, their hand exploded. Nobody spanks Chuck Norris.","Chuck Norris can have his cake, eat it, then roundhouse kick you in the face with the extra power it gave him.","Chuck Norris refuses to dip his chips in sissy assed hummas. He prefers a pile of organic tree bark, dead feral hog & whiskey humus.","Chuck Norris once accidentally broke steel by touching it.","Chuck Norris can climb Everest from top to bottom.","Chuck Norris once visited the Virgin Islands. They are now just called The Islands.","The 1972 Miami Dolphins lost one game, it was a game vs. Chuck Norris and three seven year old girls. Chuck Norris won with a roundhouse-kick to the face in overtime.","Chuck Norris was Victoria's Secret. She never walked right again.","Chuck Norris is allowed to say \"ni\" to The Knights Who Say Ni.","Chuck Norris fought the law, and the law got roundhouse kicked in the face","Chuck Norris did not shoot the Sheriff or the Deputy but he did torch thier police cruiser with a flaming porcupine.","Chuck Norris roundhouse kicked the winnyness out of Caillou.","Chuck Norris' penis is so massive that kids lose baseballs and frisbees on it","Only snails and garden slugs produce more lovemaking slime than Chuck Norris.","Chuck Norris is who told Frank the Rabbit the world will end in 28 days.","Chuck Norris does not navigate through a corn maze... The corn merely realigns itself in chucks favor out of fear of being roundhouse kicked in the ears!","In back to the future 4 Chuck Norris roundhouse kicked the Delorean back. This also gave Micheal J Fox Parkinson's.","Chuck Norris' passport is his face.","Chuck Norris has only vomited once. It was a giant ball of 100% pussy hair.","Only Expendables 2 earned its title as an All Star Movie, and that was merely by the introduction of Chuck Norris.","Chuck Norris tells Scorpian to \"get over Here\"","Chuck Norris counted to infinity - twice","Chuck Norris scares leftovers into being fresh with one bite","Chuck Norris can drink you under the table. He will then smash the table over your head.","When Chuck Norris needs a new car, he doesn't look for a car, the cars look for him!","Every morning, Chuck Norris wakes up, gets out of bed, yawns, and scratches his balls with an electric egg beater.","Chuck Norris' last name is in the android dictionary","None of the world's greatest chess grandmasters will any longer play against Chuck Norris because he always Checkmates them on his first move.","every time Chuck Norris walks into a graveyard he simply smiles and says \"good times\".","Kiri-sute gomen (&#26028;&#25448;&#24481;&#20813; or &#20999;&#25448;&#24481;&#20813;, literally, \"authorization to cut and leave\" (the body of the victim)) is an old Japanese expression dating back to the feudal era right to strike (right of samurai to kill commoners for perceived affronts). Samurai had the right to strike with sword at anyone of a lower class who compromised their honour. Chuck Norris is the only person on earth who is still allowed to do this.","Chuck Norris raped katholic priests when he was young","People can swim on water but Chuck Norris can swim on Land","Chuck Norris can chug a 2 litter bottle of rootbeer in o.oooooooooooooooooooooo.01 of a second. Try to beat that!!!!","MMA fighters wet themselves when Chuck Norris enters the room.","Chuck Norris was once in a crowded elevator when it suddenly stopped. Norris immediately climbed up through the the hatch in the ceiling, grabbed onto the cable, pointed his assult rifle at the pulley, then looked up and said 'there is no spoon. There is only Norris.'","Chuck Norris always knows the EXACT location of Carmen SanDiego.","When Chuck Norris does push up he doesn't push himself up, he pushes the world down.","Chuck Norris. The mere whisper of his terrifying name can make a hardened marine cry out in the night, impregnate a virgin and shatter all the glass within a five-mile radius.","There is a new unit of measurement called CNRKs [Chuck Norris Roundhouse Kicks]. 1 CNRK is enough to knock out something JUST tougher than 100000 lions. The Big Bang measured at 2 CNRKs, so far the only thing to certainly be more powerful than 1 CNRK. The Tsar Bomb, though, measured at a puny 0.0000327581 CNRKs, and the MOAB at 0.0000000000000000476738295873826782 CNRKs. The regular blink of a regular eye measured at an extremely puny 0.00000000000000000000000[insert 1000 zeroes here]6783758684 CNRKs.","The cosmic microwave background radiation is a remnant of Chuck Norris' birth.","Chuck Norris does not kick ass and take names. In fact, Chuck Norris kicks ass and assigns the corpse a number. It is currently recorded to be in the billions.","Chuck Norris was once invited to a Square Dance Hoedown. For clear and obvious reasons, there were no survivors.","Magicians always have an extra trick up their sleeve. Chuck Norris has an extra pair of balls up his.","The problem of illegal immigration can be dramatically curtailed, if we put Chuck Norris at the border.","There is a new Chuck Norris Visa Credit Card available. If you accrue enough Chuck Norris award points, he will personally punch the person of your choice in the face.","Chuck Norris can find the limit of an oscillating function","Little known fact: Chuck Norris deviginized Mary LONG before Joseph ever met her.","Chuck Norris makes great charcoal grilled cannibal kabobs.","Why did the chicken cross the road? To get away from Chuck Norris...it never made it to the other side.","CHUCK NORRIS uses GREAT WHITE SHARKS as his RUBBER DUCKIE","The more Chuck Norris facts you submit the better your chance of going to heaven.","Chuck Norris answers the question of his metrosexuality by simply reaching his hand down the front of your pants and popping your balls like grapes.","Chuck Norris hungers only for vengeance.","In an average day, Chuck Norris: kills 74 and a half people sleeps with 120 women eats two large automobiles saves the world thrice, and decimates a small city.","Chuck Norris isn't really a Texas Ranger, although mentioning such blasphamy in a bar setting will undoubtably start a riot. I highly recomend trying it out if you have balls 1/8th the size of Chuck's.","Chuck Norris doesn't edit Wikipedia, he roundhouse kicks the articles.","people can glow in the dark.....Chuck Norris can glow in the light.","Behind every successful man, there is a woman. Behind every dead man, there is Chuck Norris.","Chuck Norris throws up gang-signs that don't exist in this dimension.","Chuck Norris invented the hoverboard. But he only uses it as a coffee table.","When Chuck Norris has a cavity he drills out the tooth with his cordless drill and uses melted lead for a filling.","The song \"Final Countdown\" is about a man's last second after being roundhouse kicked by Chuck Norris.","What doesn't belong on this list: 1)Your wife, 2) your kids, 3) meat, 4)Chuck Norris. Ans: #4 Chuck Norris. You can beat your wife & kids half to death if you want to & you can also beat your own meat. But you can't beat Chuck Norris.","Chuck Norris is the actual King of the World.","Rosa Parks refused to give up her seat because she was saving it for Chuck Norris.","Chuck Norris once roundhouse kicked SpongeBob SquarePants in the butt so hard that SpongeBob had to legally change his name to SpongeBob ParallelogramPants.","When Chuck Norris watches Bubble Guppies, he gets pissed off and jumps into the TV and roundhouse kicks the motherf$&!ing sh*t out of them.","Chuck Norris recently ran into Nancy Pelosi and she told Chuck she had just flown in from Washington D. C. Chuck said \"oh really, where did you park your broom\"?","CHuck Norris can start a car simply by running his hands over the dash.","Chuck Norris sank the Titanic because it was his nickname.","Casinos pay Chuck Norris not to play at anything or wish anyone good luck.","Chuck Norris can have a midnight snack at quarter to four in the afternoon.","Chuck Norris assults your senses with a crowbar.","Those who fight Chuck Norris can not retreat or surrender. They're dead long before they can do either.","Chuck Norris doenst flush the toilet because he beats the shit out of it","Chuck Norris doesn't love Raymond.","Chuck Norris knows what's eating Gilbert Grape.","Chuck Norris can draw a perfect circle with a ruler","Chuck Norris can headbutt himself in the face.","When Chuck Norris air guitars, you can hear it playing. If you cannot - your death is imminent.","Leaving a criminal in the same room as Chuck Norris is considered cruel and unusual punishment.","Question: How long does it take for Chuck Norris to watch 60 Minutes? Answer: He's done watching a non-rerun episode 835 years before he starts watching it, and he doesn't even need time travel.","If you ever dare to start playing 'Six Degrees Of Chuck Norris', you will hear an ominous knock upon your front door.","Those movies when monsters attack tokyo are fake. Its just a documentery about when Chuck Norris lets his pets play outside","Filming on location for Walker: Texas Ranger, Chuck Norris brought a stillborn baby lamb back to life by giving it a prolonged beard rub. Shortly after the farm animal sprang back to life and a crowd had gathered, Chuck Norris roundhouse kicked the animal, breaking its neck, to remind the crew once more that Chuck giveth, and the good Chuck, he taketh away.","Chuck Norris once hit a home run with a grand piano.","It's actually incorrect to say that Chuck Norris does not give a fuck. He had no fucks in the first place. One cannot give fucks that one does not have.","Chuck Norris ordered egg fu yung, a banana split and a frappuccino at the local KFC and got it along with a complementary platter of lobster thermidor.","Ghostbusters call Chuck Norris","Chucky has a deep love for Chuck Norris' penis.","If you ask Chuck Norris what time it is, he'll answer 'Two seconds 'till...' When you ask him 'Two seconds 'till what?', that's when he roundhouse kicks you in the face","Chuck Norris does not own a house. He walks into random houses and people move.","Chuck Norris taught Pai Mei from kill bill 2 the Five Finger Heart Exploding Technique.","Repost: When Chuck Norris says his power level is over 9000, he's replacing that term with 777777777777777777, and sometimes, like for this, every instance of the numeral 7 is replaced by over 9000. It's proper at this moment, because that number with a bunch of sevens is, indeed, over 9000.","Chuck Norris can eat a crayon and a marker and shit out a masterpiece","The cookie crumbled because Chuck Norris glanced at it","Reece is back, Chuck Norris spam!!!","Humans believe in GOD.GOd believes in DEATH.DEATH believes in CHUCK NORRIS","Chuck Norris has never blinked in his entire life. Never.","Chuck Norris doesn't chew gum. Chuck Norris chews tin foil.","70% of a human's weight is water. 70% of Chuck Norris' weight is his dick.","freddie crougar once impersonated Chuck Norris and that is the reason why we have nightmares","Chuck Norris can satisfy an oil well.","Chuck Norris recently got Sylvester Stallone in a headlock and told him 'motherfucker if I ever hear you fucking swear I will motherfucking kill your entire motherfucking family, bitch'.","Chuck Norris shits in urinals.","When Bruce Banner gets mad, he turns into the Hulk. When the Hulk gets mad, he turns into Chuck Norris.","Chuck Norris scratches his back with a circular saw.","Chuck Norris doesn't just bend space-time, he can turn it into a goddamn balloon animal.","Chuck Norris loans money to the World Bank.","Chuck Norris watches the Watchmen.","Chuck Norris can cough in 7 different languages.","Chuck Norris uses vice drips for clothes pins...and nipple clamps.","Chuck Norris once ate a marketing director's heart.","Chuck Norris' motto: \"The difficult I do immediately. The impossible takes 3 seconds longer\".","Chuck Norris invented bacon by throwing a pig through a chain link fence.","Chuck Norris loves to eat puffer fish.","Chuck Norris learned English from a book written in Spain that was a copy of a Brazilian book that was written by a Guatemalan that was born in Turkey who copied it from a Greek that was born in Egypt that copied a book written by Homer [not Homer Simpson, that's silly] which was written in 2748677984738485 BCEsdgf,hjrwrwkdhjrkdgjchcsxdcshfkhjcgjrswI HATE IT WHEN HE DOES THAThcfjdghgklchjfujrhddcdhfbgksjdyjbkdgjfskudhOKOK IT WAS ORIGINALLY WRITTEN BY A DINOSAUR AND HOMER COPIED THAT thank you.","When Chuck Norris gets a hard-on in his pants it doesnt look like a tipi, it looks like a circus tent.","After Mr. T predicted pain in Rocky III, the studio had to hire a Mr. T look-alike to walk around the set as a safety precaution, because Chuck Norris would be the first to say be careful what you wish for.","Chuck Norris considers Ben Hur to be a midget.","Chuck Norris can rehydrate petrified wood by urinating on it.","the reason the Grudge crokes is because Chuck Norris roundhouse kicked it in the throat","people look up at the moon, while the moon looks down at Chuck Norris","Outer space exists because it's afraid to be on the same planet with Chuck Norris.","Chuck Norris occasionally wears trunks with a rainbow across the crotch. Why? Because he wants you to picture how badly he could kill you if you said something about it.","One of the main reasons there are so many mean fifth graders in the world today is because Chuck Norris stopped punching bad guys in the dick a decade ago.","Chuck Norris can live on the dark Side of the moon............naked","If Chuck Norris was the host of Chopped from food network, the one that's been chopped will be literally chopped. Luck is what you need. XD","Chuck Norris is known to jump out of televisions and roundhouse kick the viewers for no reason at all. Extreme caution is advised while watching any shows involving Chuck Norris."]